In [513]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as dt

sns.set_palette("colorblind", 10)

## What is the business problem we want to tackle?

Given the growth of Cab industry in last years, the US company XYZ wants to know which of the two given cab companies can be a better opportunity to invest in, by having a deeper understaning of the market.

In [514]:
ls

Cab_Data.csv                  Transaction_ID.csv
City.csv                      US Cities Visted 2017.xlsx
Customer_ID.csv               US cities Visited 2018.xlsx
README.md                     XYZ Cab Investment EDA.ipynb

In [515]:
cabData = pd.read_csv('Cab_Data.csv')
cityData = pd.read_csv('City.csv')
customersData = pd.read_csv('Customer_ID.csv')
transactionsData = pd.read_csv('Transaction_ID.csv')

## Data collection, quality and preprocessing

At first, I will be working with four datasets. It is also important to add value to our data when possible, so I will be searching for new data that may add attributes to our existing dataset. Then, everything will be merged into a single dataset that will let us work easily.

### Cab data

In [516]:
cabData.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.776

In [517]:
cabData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  int64
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(2), object(2)
memory usage: 19.2+ MB

In [518]:
cabData.iloc[:,4:].describe()

        KM Travelled  Price Charged   Cost of Trip
count  359392.000000  359392.000000  359392.000000
mean       22.567254     423.443311     286.190113
std        12.233526     274.378911     157.993661
min         1.900000      15.600000      19.000000
25%        12.000000     206.437500     151.200000
50%        22.440000     386.360000     282.480000
75%        32.960000     583.660000     413.683200
max        48.000000    2048.030000     691.200000

In [519]:
cabData.iloc[:,2:4].nunique()

Company     2
City       19
dtype: int64

In [520]:
cabData['Company'].unique()

array(['Pink Cab', 'Yellow Cab'], dtype=object)

In [521]:
cabData['City'].unique()

array(['ATLANTA GA', 'AUSTIN TX', 'BOSTON MA', 'CHICAGO IL', 'DALLAS TX',
       'DENVER CO', 'LOS ANGELES CA', 'MIAMI FL', 'NASHVILLE TN',
       'NEW YORK NY', 'ORANGE COUNTY', 'PHOENIX AZ', 'PITTSBURGH PA',
       'SACRAMENTO CA', 'SAN DIEGO CA', 'SEATTLE WA', 'SILICON VALLEY',
       'TUCSON AZ', 'WASHINGTON DC'], dtype=object)

In [522]:
cabData['Date of Travel'] = pd.TimedeltaIndex(cabData['Date of Travel'], unit='d') + dt.datetime(1900, 1, 1)

In [523]:
cabData['Date of Travel'].describe(datetime_is_numeric=True)

count                           359392
mean     2017-08-19 01:37:55.042294784
min                2016-01-04 00:00:00
25%                2016-11-25 00:00:00
50%                2017-09-12 00:00:00
75%                2018-05-14 00:00:00
max                2019-01-02 00:00:00
Name: Date of Travel, dtype: object

In [524]:
# I will create a new column to compute the profit made for each trip
cabData['Profit'] = cabData['Price Charged'] - cabData['Cost of Trip']

In [525]:
cabData.sample(10)

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip,Profit
37003,10046901,2016-06-22,Yellow Cab,WASHINGTON DC,2.02,35.16,27.3912,7.7688
340474,10417144,2018-12-02,Yellow Cab,BOSTON MA,30.07,391.74,414.9660,-23.2260
236541,10289174,2018-01-02,Yellow Cab,BOSTON MA,17.85,252.35,233.4780,18.8720
7261,10009254,2016-02-21,Pink Cab,SAN DIEGO CA,21.85,284.89,225.0550,59.8350
224254,10274432,2017-12-09,Yellow Cab,SILICON VALLEY,14.85,362.55,181.7640,180.7860
47572,10060108,2016-08-01,Yellow Cab,CHICAGO IL,15.12,287.70,201.3984,86.3016
180027,10221621,2017-09-09,Yellow Cab,WASHINGTON DC,44.46,658.91,533.5200,125.3900
31281,10039578,2016-05-31,Yellow Cab,NEW YORK NY,15.00,431.34,183.6000,247.7400
97488,10119817,2016-12-05,Yellow Cab,WASHINGTON DC,23.04,380.08,301.3632,78.7168
116505,10143028,2017-02-05,Yellow Cab,WASHINGTON DC,2.02,28.99,28.8456,0.1444

In [526]:
cabData.duplicated().any()

False

In [527]:
# sort values by date and reset index?

### City data

In [528]:
cityData.head()

             City   Population      Users
0     NEW YORK NY   8,405,837    302,149
1      CHICAGO IL   1,955,130    164,468
2  LOS ANGELES CA   1,595,037    144,132
3        MIAMI FL   1,339,155     17,675
4  SILICON VALLEY   1,177,609     27,247

In [529]:
cityData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     object
 2   Users       20 non-null     object
dtypes: object(3)
memory usage: 608.0+ bytes

In [530]:
# updated populations - there seems to be some imbalances
cityData.Population = pd.Series([8336817,2693976,3979576,467963,3000000,3176000,1423851,1680992,1343573,506811,
727211,978908,753675,548073,881549,513624,300286,705749,670820,692600])

In [531]:
# population has been updated previously, now I will remove commas from users column
cityData['Users'] = cityData['Users'].str.replace(',','').astype(int)

In [532]:
cityData[['Population', 'Users']].describe()

         Population          Users
count  2.000000e+01      20.000000
mean   1.669103e+06   64520.650000
std    1.892012e+06   83499.375289
min    3.002860e+05    3643.000000
25%    6.401332e+05   11633.250000
50%    8.176120e+05   23429.000000
75%    1.934238e+06   91766.000000
max    8.336817e+06  302149.000000

### Customers data

In [533]:
customersData.head()

   Customer ID Gender  Age  Income (USD/Month)
0        29290   Male   28               10813
1        27703   Male   27                9237
2        28712   Male   53               11242
3        28020   Male   23               23327
4        27182   Male   33                8536

In [534]:
customersData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49171 entries, 0 to 49170
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         49171 non-null  int64
 1   Gender              49171 non-null  object
 2   Age                 49171 non-null  int64
 3   Income (USD/Month)  49171 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [535]:
customersData.Gender.unique()

array(['Male', 'Female'], dtype=object)

In [536]:
customersData.iloc[:,2:].describe()

                Age  Income (USD/Month)
count  49171.000000        49171.000000
mean      35.363121        15015.631856
std       12.599066         8002.208253
min       18.000000         2000.000000
25%       25.000000         8289.500000
50%       33.000000        14656.000000
75%       42.000000        21035.000000
max       65.000000        35000.000000

In [537]:
customersData.duplicated().any()

False

### Transactions data

In [538]:
transactionsData.head()

   Transaction ID  Customer ID Payment_Mode
0        10000011        29290         Card
1        10000012        27703         Card
2        10000013        28712         Cash
3        10000014        28020         Cash
4        10000015        27182         Card

In [539]:
transactionsData.duplicated().any()

False

In [540]:
transactionsData['Customer ID'].duplicated().any()

True

### Adding attributes

In [541]:
# US federal holidays source: https://www.timeanddate.com/holidays/us/2019?hol=9
holidaysDates = pd.to_datetime(['2016-1-1', '2016-1-18', '2016-2-15', '2016-5-30', '2016-7-4', '2016-9-5', '2016-10-10', '2016-11-11', '2016-11-24', '2016-12-25', '2016-12-26', '2017-1-1', '2017-1-2', '2017-1-16', '2017-1-20', '2017-2-20', '2017-5-29', '2017-7-4', '2017-9-4', '2017-10-9', '2017-11-10', '2017-11-11', '2017-11-23', '2017-12-25', '2018-1-1', '2018-1-15', '2018-2-19', '2018-5-28', '2018-7-4', '2018-9-3', '2018-10-8', '2018-11-11', '2018-11-12', '2018-11-22', '2018-12-24', '2018-12-25', '2019-1-1'], format='%Y-%m-%d')
holidays = pd.Series(data=np.ones(len(holidaysDates,), dtype=int), index=holidaysDates, name='holidays')

In [542]:
# tourism just for overseas visitors travel.trade.gov for tucson source: tourism.az.gov (estimation)
overseasTourists = pd.DataFrame(data=[[9800, 10084, 10557, 10557],
                                    [1466, 1537, 1524, 1524],
                                    [4977, 4766, 5073, 5073],
                                    [5379, 5101, 5137, 5137],
                                    [3571, 3443, 3522, 3522],
                                    [695, 665, 774, 774],
                                    [1169, 1027, 1133, 1133],
                                    [301, 303, 315, 315],
                                    [571, 517, 517, 517],
                                    [725, 735, 710, 710],
                                    [312, 303, 303, 303],
                                    [226, 276, 276, 276],
                                    [658, 731, 730, 730],
                                    [187, 187, 187, 187],
                                    [3571, 3443, 3522, 3522],
                                    [241, 257, 219, 219],
                                    [139, 117, 117, 117],
                                    [2090, 2128, 2038, 2038],
                                    [214, 226, 226, 226],
                                    [1526, 1650, 1651, 1651]],
                               index=cityData.City,
                               columns=['2016 visitors', '2017 visitors', '2018 visitors', '2019 visitors'])
# average per month
overseasTourists = overseasTourists.apply(lambda x: (x*1000)/12).round(2)

In [543]:
# yearly unemployment rate by state - source: https://www.bls.gov/lau/lastch18.htm
unemploymentRate = pd.DataFrame(data=[[4.9, 4.6, 4.1, 4.1],
                                    [5.9, 5.0, 4.4, 4.4],
                                    [5.5, 4.8, 4.3, 4.3],
                                    [4.9, 4.2, 3.6, 3.6],
                                    [5.5, 4.8, 4.3, 4.3],
                                    [5.5, 4.8, 4.3, 4.3],
                                    [5.5, 4.8, 4.3, 4.3],
                                    [5.5, 4.9, 4.8, 4.8],
                                    [4.6, 4.3, 3.9, 3.9],
                                    [5.4, 4.8, 4.0, 4.0], 
                                    [3.1, 2.6, 3.0, 3.0],
                                    [4.6, 4.3, 3.9, 3.9],
                                    [5.2, 4.6, 4.4, 4.4],
                                    [5.5, 4.9, 4.8, 4.8],
                                    [5.5, 4.8, 4.3, 4.3],
                                    [5.5, 4.8, 4.3, 4.3],
                                    [5.3, 5.0, 4.4, 4.4],
                                    [6.2, 6.1, 5.7, 5.7],
                                    [4.7, 3.7, 3.5, 3.5],
                                    [4.0, 3.8, 3.4, 3.4]],
                               index=cityData.City,
                               columns=['2016 rate', '2017 rate', '2018 rate', '2019 rate'])

In [544]:
# source: NCEI - average temperature by month in degrees Celsius
averageTemperature = pd.DataFrame(data=[[0.5,2,6,12.5,18,22.5,26,25,21,15,8.5,4],
                                       [-5,-3,3.5,9.5,16,21.5,24,23,19,12,4.5,-0.5],
                                       [15.5,15,16.5,18,18.5,21,23.5,24,24,21.5,17.5,14.5],
                                       [20.5,22,22.5,25.5,27,28.5,29,29.5,28.5,27,24,22.5],
                                       [12,12.5,13.5,14,14,15.5,16,16,17.5,17,14.5,12],
                                       [15.5,15,16.5,18,18.5,21,23.5,24,24,21.5,17.5,14.5],
                                       [15,15,16.5,17.5,18.5,19.5,21.5,22.5,22.5,21,17.5,14.5],
                                       [14,15.5,20,24,27,34,35,35,32,25.5,18.5,14],
                                       [8.5,10.5,15.5,20,24.5,29,31,31.5,27.5,21,14.5,10],
                                       [6.5,9.5,13.5,18,22.5,26,27,27,25,18.5,12.5,9.5],
                                       [0,-0.5,5.5,9,13,20.5,24,22.5,19,11,5,-0.5],
                                       [11,13.5,17.5,21,25,29,30,31.5,28,22.5,16,12.5],
                                       [6,6,8.5,10.5,14,17,19.5,20,17,12.5,8,5.5],
                                       [14,15.5,20,24,27,34,35,35,32,25.5,18.5,14],
                                       [12,12.5,13.5,14,14,15.5,16,16,17.5,17,14.5,12],
                                       [9,11,13,16,22.5,23,24.5,24,22.5,18.5,12.5,9],
                                       [-2.5,-0.5,4.5,11.5,17.5,21.5,23.5,22.5,19.5,13,5.5,1.5],
                                       [3,4.5,9,15.5,20.5,25,28,26.5,23.5,16.5,9.5,6],
                                       [3.5,6.5,11,16.5,21,26,27.5,26.5,23,16.5,10,7],
                                       [-1,0,4,9.5,15.5,20,24.5,23.5,19.5,14,7,2.5]],
                                 index=cityData.City,
                                 columns=['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August',
                                         'September', 'October', 'November', 'December'])

### Building applicable dataframe

In [545]:
df1 = cabData.merge(cityData, on='City', how='left')
df2 = customersData.merge(transactionsData, on='Customer ID', how='right')

In [546]:
print(df1.columns)
print(df2.columns)

Index(['Transaction ID', 'Date of Travel', 'Company', 'City', 'KM Travelled',
       'Price Charged', 'Cost of Trip', 'Profit', 'Population', 'Users'],
      dtype='object')
Index(['Customer ID', 'Gender', 'Age', 'Income (USD/Month)', 'Transaction ID',
       'Payment_Mode'],
      dtype='object')

In [547]:
df3 = df1.merge(df2, on='Transaction ID', how='left')

In [548]:
df3.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip,Profit,Population,Users,Customer ID,Gender,Age,Income (USD/Month),Payment_Mode
0,10000011,2016-01-10,Pink Cab,ATLANTA GA,30.45,370.95,313.635,57.315,506811,24701,29290,Male,28,10813,Card
1,10000012,2016-01-08,Pink Cab,ATLANTA GA,28.62,358.52,334.854,23.666,506811,24701,27703,Male,27,9237,Card
2,10000013,2016-01-04,Pink Cab,ATLANTA GA,9.04,125.20,97.632,27.568,506811,24701,28712,Male,53,11242,Cash
3,10000014,2016-01-09,Pink Cab,ATLANTA GA,33.17,377.40,351.602,25.798,506811,24701,28020,Male,23,23327,Cash
4,10000015,2016-01-05,Pink Cab,ATLANTA GA,8.73,114.62,97.776,16.844,506811,24701,27182,Male,33,8536,Card

In [549]:
# SORT VALUES BY DATE OF TRAVEL!!

In [550]:
# joining federal holidays to the dataframe
holidays.to_frame()
holidays = holidays.reset_index()
holidays.rename(columns={'index': 'date', 'holidays': 'Holidays'}, inplace=True)

df3 = df3.merge(holidays, left_on='Date of Travel', right_on='date', how='left')

df3['Holidays'] = df3['Holidays'].replace(np.nan, 0)
df3.drop('date', axis=1, inplace=True)

In [551]:
#holidays.rename(columns={'index': 'date', 'holidays': 'Holidays'}, inplace=True)

In [552]:
#holidays.dtypes

In [553]:
#df3 = df3.merge(holidays, left_on='Date of Travel', right_on='date', how='left')

In [554]:
#df3['Holidays'] = df3['Holidays'].replace(np.nan, 0)
#df3.drop('date', axis=1, inplace=True)

In [555]:
#year = 2016
#overseasTourists[f'{year} visitors']['ATLANTA GA']

In [556]:
#df3['Date of Travel'][26].year

In [557]:
#df3['Date of Travel'][47].month

In [558]:
# create a row index column to iterate over
#df3['Row Index'] = df3.apply(lambda row: row.name, axis=1)

In [559]:
def Visitors(i):
    year = df3.iloc[i]['Date of Travel'].year
    city = df3.iloc[i]['City']
    avg_visitors = overseasTourists[f'{year} visitors'][city]
    return avg_visitors

def Unemployment(i):
    year = df3.iloc[i]['Date of Travel'].year
    city = df3.iloc[i]['City']
    rate = unemploymentRate[f'{year} rate'][city]
    return rate

months_dict = dict()

for count, month in enumerate(averageTemperature.columns, start=1):
    months_dict[count] = month

def Temperature(i):
    month = df3.iloc[i]['Date of Travel'].month
    city = df3.iloc[i]['City']
    avg_temperature = averageTemperature[months_dict[month]][city]
    return avg_temperature

In [560]:
# creating the new columns
#df3['Monthly Visitors'] = df3.apply(lambda row: Visitors(row.name), axis=1)
#df3['Unemployment Rate'] = df3.apply(lambda row: Unemployment(row.name), axis=1)
#df3['Avg Monthly Temperature'] = df3.apply(lambda row: Temperature(row.name), axis=1)

In [569]:
#df3.Holidays = df3.Holidays.astype(int)

In [570]:
#df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 359392 entries, 0 to 359391
Data columns (total 19 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   Transaction ID           359392 non-null  int64
 1   Date of Travel           359392 non-null  datetime64[ns]
 2   Company                  359392 non-null  object
 3   City                     359392 non-null  object
 4   KM Travelled             359392 non-null  float64
 5   Price Charged            359392 non-null  float64
 6   Cost of Trip             359392 non-null  float64
 7   Profit                   359392 non-null  float64
 8   Population               359392 non-null  int64
 9   Users                    359392 non-null  int64
 10  Customer ID              359392 non-null  int64
 11  Gender                   359392 non-null  object
 12  Age                      359392 non-null  int64
 13  Income (USD/Month)       359392 non-null  int64
 14  Payment_Mode             359392 non-null  object
 15  Holidays                 359392 non-null  int64
 16  Monthly Visitors         359392 non-null  float64
 17  Unemployment Rate        359392 non-null  float64
 18  Avg Monthly Temperature  359392 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(7), object(4)
memory usage: 54.8+ MB

In [574]:
# saving the final dataframe as CSV file - ALREADY SAVED!!
#df3.to_csv('/Users/juancarlos/Proyectos/XYZ Cab Investment/data.csv', index=False)

In [ ]:
# Creating some columns take a few minutes to process and to avoid that I will read the csv file straightforward
data = pd.read_csv()

In [561]:
#d = pd.DataFrame([[2,56,32,7],[89,12,10,4]], columns=['A', 'B', 'C', 'D'])

#d['E'] = pd.Series(list(map(lambda x: x*3, d['A', 'B'])))
#d['test'] = d.apply(lambda row: row.name, axis=1)
#d

In [562]:
#df3['City'][54]

In [563]:
#df3['Date of Travel'][8743].month

In [564]:
df3.index[0]

0

In [565]:
#def test():
    #calc = df3['Date of Travel'][lambda row: row.name].year
    #return calc

In [566]:
#def Visitors(i):
    #year = df3.iloc[i]['Date of Travel'].year
    #city = df3.iloc[i]['City']
    #avg_visitors = overseasTourists[f'{year} visitors'][city]
    #return avg_visitors